[{"title":"Great group of people to work with","text":"It's a great company to work for, they care about their employees and work hard to meet their needs and requests. However, if you work part-time (which most do) you have no reassure that you'll get hours, and no benefits.","rating":"4","id":"1emv4op2pu3d8800","language":"en","reviewer":"None","location":"Hammond, LA","url":"https://www.indeed.com/cmp/Best-Buy/reviews/great-group-of-people-to-work-with?id=bf279f6cd9ca05b1","datetime":"2020-11-12 00:00:00","reviewer_employee_type":"Current Employee"},{"title":"Strongly disliked","text":"Work-life balance Work-life balance at Best Buy is very hard getting up at 4 am and being home at 2 pm while ur other is working. Plus coming home exhausted from the hours made it harder Management In general, managers at Best Buy the floor manager for Best Buy IN RECEIVING (Orlando) was uptight rude and looking for reasons to fire people, my training was a joke at points, communication was awful. I was told one thing then in trouble for doing it next because no one told me more after. I was sent home multiple days even though I’d have done the most amount of trucks that day. Was told I needed to pull wait after pulling the most weight from everyone in receiving.","rating":"3","id":"1emujq497t51u800","language":"en","reviewer":"Warehouse Worker","location":"Buford, GA","url":"https://www.indeed.com/cmp/Best-Buy/reviews/strongly-disliked?id=aa0ea96903e9231f","datetime":"2020-11-12 00:00:00","reviewer_employee_type":"Current Employee"},{"title":"Fun high energy workplace","text":"Busy days lots of work to be done. Many opportunities to learn new tasks and processes. Holiday schedule is very busy for operations team LONG HOURS. ","rating":"5","id":"1emtlesg8t51g800","language":"en","reviewer":"Inventory Specialist","location":"Princeton, NJ","url":"https://www.indeed.com/cmp/Best-Buy/reviews/fun-high-energy-workplace?id=0c6e2b35ad7efb6a","datetime":"2020-11-12 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"If your desperate","text":"Work-life balance It is retail so there is no balance Pay & benefits The pay us very low.  They also want you to aggressively sell products.  Also, geek squad is a rip off. Job security and advancement I think you would have to try very hard to be fired.  But they will cut your hours. Management They all put on a cheery front.  But you can tell they really dislike their job. Culture People were fun. Overall It was bad.  I was treated poorly and ended up walking out.","rating":"2","id":"1emt3rfkuu39g800","language":"en","reviewer":"Sales Associate","location":"Addison, IL","url":"https://www.indeed.com/cmp/Best-Buy/reviews/if-your-desperate?id=19dbe8f8e013908c","datetime":"2020-11-11 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"Not bad but not great","text":"Love my coworkers, love the environment too. Some managers are a hit or miss. Best buy operates just like any corporate store though unfortunately. Unless you are a higher up in the company you will not be anything except for a number. Its retail so you get overworked and underappreciated for the  job you have.","rating":"3","id":"1emsp4ds0o15v800","language":"en","reviewer":"Customer Service Representative","location":"Shakopee, MN","url":"https://www.indeed.com/cmp/Best-Buy/reviews/not-bad-but-not-great?id=13daa575c9756285","datetime":"2020-11-11 00:00:00","reviewer_employee_type":"Current Employee"},{"title":"Overall a great experience","text":"I worked here prior to the big transition that happened recently. I loved the work environment. For retail, it was a fantastic experience. Great people that actually cared about their job, unlike most retail experiences. I loved my coworkers but management was lacking. I was a store phone operator for over a year after transitioning from Customer Service. I worked at Best Buy for just under two years and during that time I had an actual conversation with the GM once or possibly twice.","rating":"5","id":"1emsmmavsnptv800","language":"en","reviewer":"Phone Operator","location":"Appleton, WI","url":"https://www.indeed.com/cmp/Best-Buy/reviews/overall-a-great-experience?id=24bb75cf0bd9fb88","datetime":"2020-11-11 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"We fun and learned a lot","text":"Great company to work for, friendly and clean atmosphere. And they trained you so that you can be the best in knowing the information to help customers. ","rating":"4","id":"1emrrfp82u38g800","language":"en","reviewer":"Connection Sales Specialist","location":"New Hartford, NY","url":"https://www.indeed.com/cmp/Best-Buy/reviews/we-fun-and-learned-a-lot?id=295d393738f967c2","datetime":"2020-11-11 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"If you cant sell, don’t bother","text":"15$ an hour sounds great until they made you do elearnings for days, management sucks, you have to force people to buy credit cards n would take you out the schedule if you cant do that. i applied as a cashier, not to persuade people to buy credit cards. no one want any nowadays. n not to communicate why youre taken off the schedule til you have to say something. makes me scared im getting fired to finding a second job. cant have a availability, if you do you dont get hours.","rating":"2","id":"1emrcm6ilu39g800","language":"en","reviewer":"Best Buy Cashier","location":"Newark, DE","url":"https://www.indeed.com/cmp/Best-Buy/reviews/if-you-cant-sell-don-t-bother?id=3c8e537d97b07b5d","datetime":"2020-11-11 00:00:00","reviewer_employee_type":"Current Employee"},{"title":"Don’t do it unless you get into upper management. Not worth the hassle.","text":"Work-life balance There isn’t any work-life balance unless you consider the concept of being permanently on part-time salary at minimum wage. Pay & benefits Not very good for part time workers. Full time workers are highly revered because they pour more money into them and it shows. Job security and advancement Unless you have managers advocate for you HARD, there is no way upwards. You have to go above and beyond, doing ridiculous amounts of rear-end kissing to get anywhere Management Management was good while I was there. The covid-19 response seems to have shifted to “You are lucky you have a job, so you should pour your soul into your work here for next to no pay.” Culture The friendships I made at Best Buy are irreplaceable. The trauma from the toxic work environment is also. Overall Due to their covid-19 response, I have no choice but to express my utter disdain with this company. Continuing to put efforts into having people in store in a fashion that resembles anything like what it was pre-covid is enough to make me question ethics. No matter what I see on LinkedIn that the CEO is spouting about. It doesn’t matter how much you say thank you, show it to your employees instead of giving them the proverbial finger.","rating":"1","id":"1emra7iiro15v800","language":"en","reviewer":"Customer Service Specialist","location":"San Diego, CA","url":"https://www.indeed.com/cmp/Best-Buy/reviews/don-t-do-it-unless-you-get-into-upper-management-not-worth-the-hassle?id=3b4dbc5358be7226","datetime":"2020-11-11 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"Great discounts","text":"Gave great discounts. Great friendly environment. Managers provided great communication and made goals clear for the department. Easy to get time off and staff got along well with each other.","rating":"4","id":"1emq41u4qs7le800","language":"en","reviewer":"Customer Service Supervisor","location":"Westminster, CA","url":"https://www.indeed.com/cmp/Best-Buy/reviews/great-discounts?id=cb1e7dcf68fcf5c7","datetime":"2020-11-10 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"Don’t do seasonal....","text":"I worked for a week as seasonal learning the cash register. The next week I went in for my hours only to find out I had none because of hour cuts and was told they would let me know by Wednesday of that week. I still hadn’t heard from them after repeatedly calling and emailing a few times what was going on with my job. Apparently, when you are a temp you are on the chopping block first and they don’t bother to tell you. Highly unprofessional. Would not recommend. ","rating":"1","id":"1emq1tt0us7le800","language":"en","reviewer":"Advisor Sales ","location":"North Little Rock, AR","url":"https://www.indeed.com/cmp/Best-Buy/reviews/don-t-do-seasonal?id=7e60d27413fa9fcd","datetime":"2020-11-10 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"Decent work culture, bad management","text":"The pay is decent but be prepared for them to constantly cut hours, even if you’re full-time. The employees are pretty nice though and will help you if needed. However, the managers all need to go.","rating":"3","id":"1emned208ocqa800","language":"en","reviewer":"Sales Associate","location":"Virginia Beach, VA","url":"https://www.indeed.com/cmp/Best-Buy/reviews/decent-work-culture-bad-management?id=541ee4f4afd7cd67","datetime":"2020-11-09 00:00:00","reviewer_employee_type":"Current Employee"},{"title":"Very Professional","text":"Great workers, great staff, great place to work. Learned allot from others and became a great person even outside of the company. If your looking for a place to start, start here.","rating":"5","id":"1emnd8r39sa3l800","language":"en","reviewer":"Salesperson","location":"65th Infantry, PR","url":"https://www.indeed.com/cmp/Best-Buy/reviews/very-professional?id=e2dedd4ba2d7f58a","datetime":"2020-11-09 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"Absolutely No Hours and Unprofessional Management","text":"The Management is really all around the place and the hours are VERY thin, I was told that as the weeks progress towards the holidays, I was supposed to be getting more hours and that wasn't true at all. I originally applied for part-time stocker, then they changed the positions three times and I ended up being seasonal part-time product flow. My first week I got two days of work, then my second week I got 1 day, then my third week, I got 0 days and 0 hours. ","rating":"2","id":"1emncmieuu1ac800","language":"en","reviewer":"Product Flow Specialist","location":"Fort Worth, TX","url":"https://www.indeed.com/cmp/Best-Buy/reviews/absolutely-no-hours-and-unprofessional-management?id=c8fb84fab6bf5240","datetime":"2020-11-09 00:00:00","reviewer_employee_type":"Current Employee"},{"title":"Great job if you work hard to go above and beyond and don't mind constant change","text":"I worked here for 17 years. They are a great company and the culture there is amazing. I was able to advance from occasional seasonal to a leadership role in about a year. Eventually I became management. Retail work is a fast paced and quickly changing environment so if that is difficult for you then this wouldn't be the job to get (not everyone is the same when it comes to what type of work they like best). But if you are a hard worker and flexible and able to change quickly with the times, Best Buy is a great place to work.","rating":"4","id":"1emn769bbnpup800","language":"en","reviewer":"Various Leadership Positions","location":"Merced, CA","url":"https://www.indeed.com/cmp/Best-Buy/reviews/great-job-if-you-work-hard-to-go-above-and-beyond-and-don-t-mind-constant-change?id=c37bf686e811f0b8","datetime":"2020-11-09 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"Great place to work and grow","text":"I loved my time at BestBuy. I still have many friends from both of the locations at which I worked, and I still shop there all the time. They treat their employees well, promote and reward associates based on performance, and have solid benefits packages at all levels. At least at the locations I worked, management stood behind their associates and helped them grow. I don't hesitate to recommend working for BestBuy at the associate level or in leadership","rating":"5","id":"1emmv286pu1ac800","language":"en","reviewer":"Magnolia Supervisor, Computing Supervisor, Appliances Supervisor","location":"Indianapolis, IN","url":"https://www.indeed.com/cmp/Best-Buy/reviews/great-place-to-work-and-grow?id=7716635475bb1f9e","datetime":"2020-11-09 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"No hours. No communication. Will work you to the bone and then turn around and give everyone 8 hours/week.","text":"Work-life balance Work-life balance at Best Buy is too much life not enough work.  Can't have a life if you can't afford it.  You won't get the hours promised.  Apply at target.","rating":"1","id":"1emmtnb4bocqa800","language":"en","reviewer":"Product Flow Specialist","location":null,"url":"https://www.indeed.com/cmp/Best-Buy/reviews/no-hours-no-communication-will-work-you-to-the-bone-and-then-turn-around-and-give-everyone-8-hours-week?id=f3cfae0590d23846","datetime":"2020-11-09 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"Hours are all over the place, and few.","text":"I started here and really regret it. I thought it would be lively, but is depressing. We get yelled at if our masks slip beneath our noses even after several hours on the shift. I use an app and a device to scan expensive products. I am sad to say I do not like this work and regret applying here. One week I am scheduled 4 days, sometimes until midnight. Last week they scheduled me and then pulled me off the schedule except for one day. I am only schedule 12 hours this week and can't pay my bills. I wish I had worked somewhere else. ","rating":"2","id":"1emmrgp0du1m2800","language":"en","reviewer":"Associate","location":"Alpharetta, GA","url":"https://www.indeed.com/cmp/Best-Buy/reviews/hours-are-all-over-the-place-and-few?id=3a747dddc505c931","datetime":"2020-11-09 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"Started off fine, but management needs better communication","text":"Everything's fine until it's managers are not in line with one another for the plan of success. Every department kind of does their own thing and never remember half the things they tell you. ","rating":"3","id":"1emlskicju1ac800","language":"en","reviewer":"Sales Representative","location":"Austin, TX","url":"https://www.indeed.com/cmp/Best-Buy/reviews/started-off-fine-but-management-needs-better-communication?id=a8322d04f9771bb7","datetime":"2020-11-09 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"An alright place to work","text":"Pay is fine, but at my location, training was awful. Staff members were just thrown in to working with little knowledge of how to use the programs. People were constantly not showing up to work (but not fired for it?) leaving you to just struggle with no help.","rating":"3","id":"1emkvu6d6u1ac800","language":"en","reviewer":"Customer Service Representative","location":"Sanford, FL","url":"https://www.indeed.com/cmp/Best-Buy/reviews/an-alright-place-to-work?id=1147a1aaef3687c0","datetime":"2020-11-08 00:00:00","reviewer_employee_type":"Former Employee"}]