[{"title":"Good experience working with IBM","text":"I had a good experience working with IBM. I got a better offer from another company so I decided to go, but it is a good company. I was traveling 50% of the time. It depends of the customer requirement.","rating":"5","id":"1egof81ii3cfd000","language":"en","reviewer":"Oracle Cloud Solution Architect","location":"Miami, FL","url":"https://www.indeed.com/cmp/IBM/reviews/good-experience-working-with-ibm?id=d285705170d0f08d","datetime":"2020-08-27 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"great company and salary scale.","text":"great company excellent for career path growth. Excellent training opportunity and online classes. Good salary scale and flexible work hours. very demanding with ","rating":"4","id":"1egocb8bvrg31800","language":"en","reviewer":"Senior Global Command Center Technician","location":"Fort Worth, TX","url":"https://www.indeed.com/cmp/IBM/reviews/great-company-and-salary-scale?id=854aeaf42c00a380","datetime":"2020-08-27 00:00:00","reviewer_employee_type":"Current Employee"},{"title":"Good working place with supportive team members","text":"Day to day working activities and dealing with stories and spints. I enjoyed my work place with very good and supportive team members. Checking the logs and building ci/cd pipelines","rating":"5","id":"1egm5to52q2r1800","language":"en","reviewer":"System Administrator","location":null,"url":"https://www.indeed.com/cmp/IBM/reviews/good-working-place-with-supportive-team-members?id=62e7db9c8a2c9b80","datetime":"2020-08-26 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"Always doing something new everyday. Very Flexible job. Great pay and a sense of a commmunity.","text":"IBM is the most flexible job I've ever had. They allow you to work from home if necessary and encourage all employees to continue to learn new things to become SMEs. You feel like you learn something new everyday. They have built a thriving community within the company. Management makes time to listen to your needs and provides constructive criticism to help you grow. Time flies by, you will have to work hard though.","rating":"5","id":"1egk3q16eqh1c800","language":"en","reviewer":"Project Manager","location":"Columbia, MO","url":"https://www.indeed.com/cmp/IBM/reviews/always-doing-something-new-everyday-very-flexible-job-great-pay-and-a-sense-of-a-commmunity?id=0245d940045454ba","datetime":"2020-08-25 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"Excellent work environment and collaboration between teams.","text":"Innovative, supportive work environment.  Best in class employment policies and support.  Innovative technology.   Excellent continuing education and mentoring.","rating":"4","id":"1eggjep58of93800","language":"en","reviewer":"HR Representative","location":"Houston, TX","url":"https://www.indeed.com/cmp/IBM/reviews/excellent-work-environment-and-collaboration-between-teams?id=40d548654b45263c","datetime":"2020-08-24 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"Very positive work environment","text":"IBM is a very good work environment.  They are very forward-thinking when it comes to diversity and inclusion.  Management seems to accept the fact that employees are adults, and capable of making our own decisions.  The downside? You learn a lot through trial-and-error.  Example: I was assigned a \"The basics of how to do your job\" after 6 months in the role, rendering the training pointless, but it was required.  Also was not introduced to my team, but instead expected to sit in my seat and perhaps introduce myself to those around me? Felt very uncomfortable.  Other than that, most people are very helpful and willing to offer guidance, as long as you know who they are.","rating":"4","id":"1eg6ufd9nr3bb800","language":"en","reviewer":"IFA","location":"Rochester, MN","url":"https://www.indeed.com/cmp/IBM/reviews/very-positive-work-environment?id=4058d799d9d09ec8","datetime":"2020-08-20 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"Dead end (specific to support)","text":"I got baited into taking a support position, when I was looking for development. I was under the impression that I would be supporting the clients by making code changes, but that was not the case.  I was also lied to about what team I would be on - the posting mentioned a specific product which I researched for weeks before I started, only to find out I would be working on a completely different product, which shared a brand for about a month. It wasn't made clear in the job posting that every few months, you would be expected to go on call. There was no mentorship, and no training materials. You were expected to figure things out on your own, on a product that I didn't even have access to (having access to a system which was four releases out of date before I even started doesn't count). We were told countless times that if there's a problem, we should let the clients run into it before telling them we have a fix for it. Because \"it looks bad\" if they are told there's a problem. The only positive I can think about is the above average pay for the type of work being performed. But above average starting compensation was just the bait - there is no hope for advancement in support. I got a full salary band promotion, and my raise was 5%.","rating":"2","id":"1eg6inc8hq3pl800","language":"en","reviewer":"Staff Software Engineer, Support","location":"Durham, NC","url":"https://www.indeed.com/cmp/IBM/reviews/dead-end-specific-to-support?id=76bd93a26b9c71ac","datetime":"2020-08-20 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"Culturally strong and ethically driven","text":"The best company I have worked with so far. Extremely employee friendly Culturally strong and ethically driven, IBM absolutely runs by its values. ","rating":"5","id":"1eg096ui23djs000","language":"en","reviewer":"Account based marketing manager","location":null,"url":"https://www.indeed.com/cmp/IBM/reviews/culturally-strong-and-ethically-driven?id=60352fc98afb3af2","datetime":"2020-08-18 00:00:00","reviewer_employee_type":"Current Employee"},{"title":"Hired for Test Tech, thrown into Assembly","text":"I was hired to be a test tech, stress testing their Z Mainframes.  It was a lie, I was thrown into Assembly pulling ethernet and ram cards out of their books.  I was terminated for \"refusing to work\", which is a total lie, they don't enough work to go around and employees are talking about furloughs.  ","rating":"1","id":"1efv5gtctr572800","language":"en","reviewer":"\"test tech\" is what I was hired for, I worked in Assembly","location":"Poughkeepsie, NY","url":"https://www.indeed.com/cmp/IBM/reviews/hired-for-test-tech-thrown-into-assembly?id=8e3e409ef2577d00","datetime":"2020-08-17 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"Management is Achilles' Heel","text":"Talented people and teammates, but in my 7 years at IBM, I had one good manager out of a total of four.  Either don't know what's going on, can't tell you, or are in charge of laying people off.  Promises made are not often kept (band bump to come after moving to a new position, will give backpay to cover the differential = band bump came after 18 months in the position. For me, I moved from a band 4 to a band 6/7 position and got band 6 promotion 18 months after starting that job and due primarily to earning a certification, rather than doing the job at the level and getting underpaid for it.  No backpay was ever provided for those 18 months. So - yeah.","rating":"3","id":"1efk7ehb13chj000","language":"en","reviewer":"Senior Project Manager","location":"Dubuque, IA","url":"https://www.indeed.com/cmp/IBM/reviews/management-is-achilles-heel?id=84563c1c73881815","datetime":"2020-08-13 00:00:00","reviewer_employee_type":"Current Employee"},{"title":"Covid 19 response","text":"Laid off workers with new CEO weeks into his tenure. March/April several thousand workers laid off due to COVID-19. Same 3 month severance package given to individuals who had been there 30 years or 3 years. ","rating":"1","id":"1efi6hjk6ss95800","language":"en","reviewer":"Salesforce.com Consultant","location":"Denver, CO","url":"https://www.indeed.com/cmp/IBM/reviews/covid-19-response?id=c069aac802fcdde0","datetime":"2020-08-12 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"Productive and great place to work","text":"Great place to work from day one until now. typical day here is great I have learned several new programs as for management it a blessing workplace Most enjoyable co-worker ","rating":"5","id":"1efhslg0e3gjj000","language":"en","reviewer":"EA Receptionist","location":"New York, NY","url":"https://www.indeed.com/cmp/IBM/reviews/productive-and-great-place-to-work?id=c6dfe863cf1dbc6d","datetime":"2020-08-12 00:00:00","reviewer_employee_type":"Current Employee"},{"title":"Long distant manager","text":"IBM was awarded the IT services by out sourcing it. I was \"rebadged\" from State Street to IBM. I worked at State Street but under IBM's rule. My manager was in Maine and I was in Quincy. Big disconnect. My previous role did not match with the role I was given. IBM is very bottom line thinking and got in the way of doing normal work. Lousy experience.","rating":"1","id":"1efhmp4233gjj000","language":"en","reviewer":"Team Lead, Portable Storage Media","location":"Quincy, MA","url":"https://www.indeed.com/cmp/IBM/reviews/long-distant-manager?id=491cb6b5f2b86549","datetime":"2020-08-12 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"great work life balance","text":" I worked in GTS for 4 years and experienced a couple of reorgs. The reorg decisions came from higher levels and really do not make sense in the eyes of people who do the daily work. No surprise we keep losing business. ","rating":"4","id":"1effujkmlp171800","language":"en","reviewer":"DBA","location":"Atlanta, GA","url":"https://www.indeed.com/cmp/IBM/reviews/great-work-life-balance?id=94147516e46411a8","datetime":"2020-08-11 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"IBM Services Awesome","text":"Our Team efforts to meet Service Level Agreements were awesome great team I worked with including National duty managers project managers etc.. I enjoyed this company, a lot was cut out family day, picnics, award ceremonies, differential pay, bonus, holiday certificate for turkey and hams, I became a contractor we were underpaid  I was paid more as an employee just felt like IBM name is on everything and we should have had decent salaries I was with company 19 to 20 years never received a plaque for years of service called H.R and the award dept said unfortunately, they dont give plaques employee appreciation is definitely needed for all employees rather Vendors Contractors or an IBM regular, my job went to India which that's another situation that needs to changed, we should not lose jobs to overseas IBM definitely is  a place to work independently if you're self sufficient, IBM was awesome.","rating":"5","id":"1effrmneup171800","language":"en","reviewer":"Help Desk /Account Specialist","location":"Smyrna, GA","url":"https://www.indeed.com/cmp/IBM/reviews/ibm-services-awesome?id=49e4ba4da6c726e3","datetime":"2020-08-11 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"IBM has really gone down hill and it's sad to see","text":"IBM has really gone through changes that are not good for the compnay as a whole.  The leadership is out to protect themselves and they don't seem to care who they step on in the process","rating":"1","id":"1effqp3vup171800","language":"en","reviewer":"Managing Consultant","location":"Houston, TX","url":"https://www.indeed.com/cmp/IBM/reviews/ibm-has-really-gone-down-hill-and-it-s-sad-to-see?id=aee1d6ea305d9240","datetime":"2020-08-11 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"Flexible work environment with great people","text":"I was a Financial Analysis Consultant with IBM and it had pros and cons. 90% of the people I worked with were positive and willing to help when needed. A few managers (not usually in my direct line) were helpful in making sure I had what I needed to succeed. The hardest part of my job was making a work/life balance. Since teams were made up of resources from all over the world, meetings were not always during my 8-5 workday. It took a few conversations to come to an agreement on how these issues would be handled and in the end, everyone was happy with the outcome. I do not like to let a few bad apples ruin my view of an entire company, so if I were given the opportunity, I would most likely return to work at IBM.","rating":"4","id":"1efcnr40eoeea800","language":"en","reviewer":"Financial Analyst Consultant and Project Manager","location":"Lakeland, FL","url":"https://www.indeed.com/cmp/IBM/reviews/flexible-work-environment-with-great-people?id=4a605e8468521be9","datetime":"2020-08-10 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"Productive and Super Fast Paste Environment","text":"Super Fast Paste Environment, great opportunity to learn and grow. Huge team, many of the team members are working off-shore, a few working on-shore...","rating":"3","id":"1ef9vv3anofd5800","language":"en","reviewer":"Subject Matter Expert - QA Tester / Developer","location":"First Canadian Place","url":"https://www.indeed.com/cmp/IBM/reviews/productive-and-super-fast-paste-environment?id=c07b9695b6bc11eb","datetime":"2020-08-09 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"I was able to train in 18 different departments","text":"I worked at IBM through Manpower. Had I been highered by IBM, I would have gotten FT benefits vacation, sick leave and all. Manpower does not have any of these so I was able to work OT as much as possible to make up the money I would of made from IBM. I found the Somolians to be quite lazy, expecting things their way, etc. Very annoying to see management NOT correct this problem--would have been more productive, esp. when they excersised their religion. They were gone longer than usual and got away with it leaving the team short handed, esp. on end of month, quarter, and year. Otherwise, I loved the learning experience, trainers, supervisors. They saw I wanted to work and got all the chances, 7 days a week, holidays. I never took off or got sick. I loved it!","rating":"3","id":"1ef7c68sbp1h1800","language":"en","reviewer":"Class 1 Builder","location":null,"url":"https://www.indeed.com/cmp/IBM/reviews/i-was-able-to-train-in-18-different-departments?id=9873ad415a0ffa11","datetime":"2020-08-08 00:00:00","reviewer_employee_type":"Former Employee"},{"title":"Small stable group teams","text":"IBM is big, but you can find small teams that are stable, well-run, and fun to work in.  Immediate and upper management control much of the culture, so teams can vary widely in dynamics.","rating":"4","id":"1ef4vs4lopbqj800","language":"en","reviewer":"ETL Developer","location":"Remote","url":"https://www.indeed.com/cmp/IBM/reviews/small-stable-group-teams?id=d2687ccb0279dd80","datetime":"2020-08-07 00:00:00","reviewer_employee_type":"Former Employee"}]